# -*- coding: utf-8 -*-
# Маніфест модуля Odoo
{
    'name': "Energy Optimization System",  # Назва модуля
    'summary': """
        Моделювання та оптимізація споживання енергії з різних джерел.
    """,
    'description': """
        Цей модуль Odoo дозволяє:
        - Завантажувати погодинні дані споживання.
        - Завантажувати погодинні дані сонячної генерації.
        - Завантажувати погодинні ціни на газ для генератора.
        - Завантажувати погодинні ціни на електроенергію з мережі.
        - Запускати оптимізаційні моделі для визначення найдешевшого енергетичного міксу.
        - Зберігати та візуалізувати результати оптимізації.
    """,
    'author': "Ярослав Гришин/HD Group LLC",  # Автор модуля
    'website': "http://www.hlibodar.com.ua",  # Веб-сайт компанії
    'category': 'Tools',  # Категорія модуля
    'version': '1.0',  # Версія модуля
    'depends': ['base', 'mail', 'web'],  # Залежності модуля
    'data': [
        'security/ir.model.access.csv',  # Права доступу
        'data/ir_sequence_data.xml',  # Дані для послідовностей
        'views/energy_data_views.xml',  # Відображення для вхідних даних
        'views/energy_optimization_run_views.xml',  # Відображення для оптимізації
        'views/menu.xml',  # Визначення меню модуля
    ],
    'installable': True,  # Модуль може бути встановлений
    'application': True,  # Модуль є повноцінним додатком
    'auto_install': False,  # Не встановлювати автоматично
    'license': 'LGPL-3',  # Ліцензія
}